# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url,sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [4]:
occu_mean_age = round(users.groupby('occupation').agg({'age':'mean'}),2)
occu_mean_age

                 age
occupation
administrator  38.75
artist         31.39
doctor         43.57
educator       42.01
engineer       36.39
entertainment  29.22
executive      38.72
healthcare     41.56
homemaker      32.57
lawyer         36.75
librarian      40.00
marketing      37.62
none           26.56
other          34.52
programmer     33.12
retired        63.07
salesman       35.67
scientist      35.55
student        22.08
technician     33.15
writer         36.31

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [13]:
# good question for me
#group by occupation 
# total count of users 
# count male and take ratio
occu_group = users.groupby(['occupation','gender'])
occu_group.size().to_frame()

                        0
occupation    gender
administrator F        36
              M        43
artist        F        13
              M        15
doctor        M         7
educator      F        26
              M        69
engineer      F         2
              M        65
entertainment F         2
              M        16
executive     F         3
              M        29
healthcare    F        11
              M         5
homemaker     F         6
              M         1
lawyer        F         2
              M        10
librarian     F        29
              M        22
marketing     F        10
              M        16
none          F         4
              M         5
other         F        36
              M        69
programmer    F         6
              M        60
retired       F         1
              M        13
salesman      F         3
              M         9
scientist     F         3
              M        28
student       F        60
              M       136
technician    F         1
              M        26
writer        F        19
              M        26

### Step 6. For each occupation, calculate the minimum and maximum ages

In [17]:
occu_min_max_age = users.groupby(['occupation']).agg({'age':['min','max']})
occu_min_max_age

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [24]:
combined_mean_age = users.groupby(['occupation','gender'])
combined_mean_age['age'].mean().to_frame()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

### Step 8.  For each occupation present the percentage of women and men

In [29]:
percent_m_f = users.groupby('occupation')
percent_m_f['gender'].value_counts(normalize=True)*100

occupation     gender
administrator  M          54.430380
               F          45.569620
artist         M          53.571429
               F          46.428571
doctor         M         100.000000
educator       M          72.631579
               F          27.368421
engineer       M          97.014925
               F           2.985075
entertainment  M          88.888889
               F          11.111111
executive      M          90.625000
               F           9.375000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         M          83.333333
               F          16.666667
librarian      F          56.862745
               M          43.137255
marketing      M          61.538462
               F          38.461538
none           M          55.555556
               F          44.444444
other          M          65.714286
               F          34.285714
programmer     M          90.909091
               F           9.090909
retired        M          92.857143
               F           7.142857
salesman       M          75.000000
               F          25.000000
scientist      M          90.322581
               F           9.677419
student        M          69.387755
               F          30.612245
technician     M          96.296296
               F           3.703704
writer         M          57.777778
               F          42.222222
Name: gender, dtype: float64